#include <stdio.h>
  /*
1
Заполнить массив значениями согласно варианту. Результат в виде таблицы значений массива вывести на консоль.
2
Реализовать перемножение двух матриц 2х2 на основании данных варианта задания. Результат в виде таблицы значений элементов результирующей матрицы вывести на консоль.
  */


  int main(void) {

    ///////////////////////////
    //                       //
    //    выводим массив     //
    ///////////////////////////

    int a[8] = {77, 12, 74, 34, 56, 78, 234, 678};

    for (int i = 0; i < 8; i++)
      printf("%d\n", a[i]);
  
    ///////////////////////////
    //                       //
    //  перемножение матриц  //
    ///////////////////////////

    int matrix[2][4] = {
      {2, 1,
       1, 2},

      {1, 3,
       3, 1},
    };
    printf("\nРезультат перемножения матриц:\n%d %d",
      matrix[0][0] * matrix[1][0] + matrix[0][1] * matrix[1][2],
      matrix[0][0] * matrix[1][1] + matrix[0][1] * matrix[1][3]);
    printf("\n%d %d\n",
      matrix[0][2] * matrix[1][0] + matrix[0][3] * matrix[1][2],
      matrix[0][2] * matrix[1][1] + matrix[0][3] * matrix[1][3]);

    return 0;
  }

